# Dependencias

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

# Carga

In [3]:
path = '../data/raw/train.csv'
df = pd.read_csv(path)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
df.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
735,736,0,3,"Williams, Mr. Leslie",male,28.5,0,0,54636,16.10,NaN,S
109,110,1,3,"Moran, Miss. Bertha",female,NaN,1,0,371110,24.15,NaN,Q
637,638,0,2,"Collyer, Mr. Harvey",male,31.0,1,1,C.A. 31921,26.25,NaN,S
363,364,0,3,"Asim, Mr. Adola",male,35.0,0,0,SOTON/O.Q. 3101310,7.05,NaN,S
611,612,0,3,"Jardin, Mr. Jose Neto",male,NaN,0,0,SOTON/O.Q. 3101305,7.05,NaN,S

# Imputando valores

## Columna `Age`
Segun las `Acciones a realizar` **-índice-** en la fase exploratoria (EDA)
[Ir a análisis exploratorio](./01_exploration.ipynb)

promedio de edad por sexo

In [6]:
# Cantidad de valores faltantes
df.loc[df['Age'].isnull(),['Sex']].count()

Sex    177
dtype: int64

In [7]:
# Guarda en la variable los índices de todas las filas donde la columna `Age` tiene un valor nulo.
edades_nan = list(df.loc[df['Age'].isnull(),['Age']].index)
edades_nan

[5,
 17,
 19,
 26,
 28,
 29,
 31,
 32,
 36,
 42,
 45,
 46,
 47,
 48,
 55,
 64,
 65,
 76,
 77,
 82,
 87,
 95,
 101,
 107,
 109,
 121,
 126,
 128,
 140,
 154,
 158,
 159,
 166,
 168,
 176,
 180,
 181,
 185,
 186,
 196,
 198,
 201,
 214,
 223,
 229,
 235,
 240,
 241,
 250,
 256,
 260,
 264,
 270,
 274,
 277,
 284,
 295,
 298,
 300,
 301,
 303,
 304,
 306,
 324,
 330,
 334,
 335,
 347,
 351,
 354,
 358,
 359,
 364,
 367,
 368,
 375,
 384,
 388,
 409,
 410,
 411,
 413,
 415,
 420,
 425,
 428,
 431,
 444,
 451,
 454,
 457,
 459,
 464,
 466,
 468,
 470,
 475,
 481,
 485,
 490,
 495,
 497,
 502,
 507,
 511,
 517,
 522,
 524,
 527,
 531,
 533,
 538,
 547,
 552,
 557,
 560,
 563,
 564,
 568,
 573,
 578,
 584,
 589,
 593,
 596,
 598,
 601,
 602,
 611,
 612,
 613,
 629,
 633,
 639,
 643,
 648,
 650,
 653,
 656,
 667,
 669,
 674,
 680,
 692,
 697,
 709,
 711,
 718,
 727,
 732,
 738,
 739,
 740,
 760,
 766,
 768,
 773,
 776,
 778,
 783,
 790,
 792,
 793,
 815,
 825,
 826,
 828,
 832,
 837,
 839,
 846,
 849,
 859,
 863,
 868,
 878,
 888]

In [8]:
#  Permite ver el sexo y la edad (que será NaN) de los pasajeros que tienen valores faltantes en la columna Age.
df.loc[edades_nan,['Sex', 'Age']]

        Sex  Age
5      male  NaN
17     male  NaN
19   female  NaN
26     male  NaN
28   female  NaN
..      ...  ...
859    male  NaN
863  female  NaN
868    male  NaN
878    male  NaN
888  female  NaN

[177 rows x 2 columns]

In [9]:
# Se realiza un copia del df original
# Esto permiteconservar el DataFrame original para futuras comparaciones o restauraciones.
df_copy = df.copy()

In [10]:
# Muestra todas las filas del DataFrame `df_copy` donde la columna Age es NaN (faltante) y la columna Sex es 'male'.
df_copy[(df['Age'].isnull()) & (df['Sex'] == 'male')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
29,30,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,NaN,S
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
839,840,1,1,"Marechal, Mr. Pierre",male,NaN,0,0,11774,29.7000,C47,C
846,847,0,3,"Sage, Mr. Douglas Bullen",male,NaN,8,2,CA. 2343,69.5500,NaN,S
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S

### Asignando valores

Asigna el valor 30.7 a la columna `Age` en todas las filas de `df_copy` donde Age es NaN (faltante) y Sex es '**male**'.

In [11]:
df_copy.loc[(df_copy['Age'].isnull()) & (df_copy['Sex'] == 'male'),'Age'] = 30.7

Asigna el valor 27.9 a la columna `Age` en todas las filas de `df_copy` donde Age es NaN (faltante) y Sex es '**female**'.

In [12]:
df_copy.loc[(df_copy['Age'].isnull()) & (df_copy['Sex'] == 'female'),'Age'] = 27.9

In [13]:
# Verificacion
df_copy.loc[edades_nan,['Sex', 'Age']]

        Sex   Age
5      male  30.7
17     male  30.7
19   female  27.9
26     male  30.7
28   female  27.9
..      ...   ...
859    male  30.7
863  female  27.9
868    male  30.7
878    male  30.7
888  female  27.9

[177 rows x 2 columns]

In [14]:
# Verificacion de cantidad de NaN en `df_copy`
df_copy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## Columna `Cabin`

### **Convertimos la columna `Cabin` en una variable binaria:**

- **0** si el valor era faltante (no tenía cabina asignada)  
- **1** si tenía un valor (sí tenía cabina asignada)

Segun las `Acciones a realizar` **-índice-** en la fase exploratoria (EDA)
[Ir a análisis exploratorio](./01_exploration.ipynb)

**Generamos indice para los datos `NaN`**

In [ ]:
# Guarda en la variable los índices de todas las filas donde la columna `Cabin` tiene valores faltantes.
indice_cabin_nan = list(df_copy.loc[df_copy['Cabin'].isnull(),['Cabin']].index)
indice_cabin_nan

**Generamos indice para los datos `noNaN`**

In [ ]:
# Guarda en la variable los índices de todas las filas donde la columna `Cabin` tiene valores no NaN.
indice_cabin_nonan = list(df_copy.loc[df_copy['Cabin'].notnull(),['Cabin']].index)
indice_cabin_nonan

**Convertimos la columna `Cabin` en una variable binaria:**

- **0** si el valor era faltante (no tenía cabina asignada)  
- **1** si tenía un valor (sí tenía cabina asignada)

Asigna el valor **0** a la columna `Cabin` en todas las filas de `df_copy` cuyos índices están en la lista `indice_cabin_nan`, es decir, donde el valor de `Cabin` **es NaN** (faltante).

In [18]:
df_copy.loc[indice_cabin_nan,['Cabin']] = 0

Asigna el valor **1** a la columna `Cabin` en todas las filas de `df_copy` cuyos índices están en la lista `indice_cabin_nonan`, es decir, donde el valor de `Cabin` **no es NaN** (no faltante).

In [21]:
df_copy.loc[indice_cabin_nonan,['Cabin']] = 1

### **Comprobacion de proporciones correctas**

In [ ]:
# Verificacion
df_copy.loc[indice_cabin_nan,['Survived', 'Cabin']]

     Survived Cabin
0           0     0
2           1     0
4           0     0
5           0     0
7           0     0
..        ...   ...
884         0     0
885         0     0
886         0     0
888         0     0
890         0     0

[687 rows x 2 columns]

In [ ]:
# Visualizacion de proporcion de 0 y 1
df_copy['Cabin'].value_counts()

Cabin
0    687
1    204
Name: count, dtype: int64

### Creacion Columna Cabin_missing

In [28]:
df_copy['Cabin_missing'] = df_copy['Cabin']

Eliminamos del Dataframe `df_copy` la columna `Cabin`

In [30]:
df_copy.drop('Cabin', axis=1, inplace=True)

## Columna Embarked

Asigna el valor **S** a las dos filas de `Embarked` segun las `Acciones a realizar` en la fase exploratoria (EDA)
[Ir a análisis exploratorio](./01_exploration.ipynb)

In [33]:
df_copy.loc[[61, 829],['Embarked']] = 'S'